0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 101325;

boundaryField
{
    back
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    front
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    bottom
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    top
    {
        type            totalPressure;
	p0		uniform 101325;
        value           uniform 101325;
    }
    right
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    left
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    gasSides
    {
        type            totalPressure;
	p0		uniform 101325;
        value           uniform 101325;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
