constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type    massTransferMultiphaseSystem;
phases  (solid liquid gas);
gas
{
    type            multiComponentMovingPhaseModel;
}
liquid
{
    type            pureMovingPhaseModel;
}
solid
{
    type            pureStaticSolidPhaseModel;
}
interfacePorous
(
    (solid and liquid)
    {
        type            VollerPrakash;
        solidPhase      alpha.solid;
        Cu              1e10;
    }
);
surfaceTension
(
    (solid and liquid)
    {
            	    type                constant;
	    sigma               0.00;
    }
    (solid and gas)
    {
            	    type                constant;
	    sigma               0.00;
    }
    (gas and liquid)
    {
      	    type                temperatureDependent;
	    sigma               table
	    (
		    	(1700		1.750)
		    	(2000		1.720)
			 	(2300		1.690)
			 	(2600		1.660)
			 	(2900  		1.630)
			 	(3200  		1.600)
			 	(3500		1.570)
			 	(3800		1.540)
			 	(4100		1.510)
			 	(4400		1.480)
			 	(4700		1.450)
			 	(5000		1.420)
			 	(10000 		0.920)
	    );
    }
);
massTransferModel
(
    (solid to liquid)
    {
        type            Lee;
        C               3.25e6;
        Tactivate       1690.65;
    }
    (liquid to solid)
    {
        type            Lee;
        C               -3.25e6;
        Tactivate       1690.65;
    }
    (liquid to gas)
    {
        type                kineticGasEvaporation;
        species             vapour.gas;
          C    0.05;
        isoAlpha            0.005;
        Tactivate           3090;
   }
);
// ************************************************************************* //
