constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev.develop                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       tabulated;
    thermo          hTabulated;
    equationOfState icoTabulated;
    specie          specie;
    energy          sensibleEnthalpy;
}

// ************************************************************************* //


mixture
{
    specie
    {
        nMoles          1;
        molWeight       55.35;
    }
    equationOfState
    {
        rho
        (
	(300	6979)
	(1700	6979)
	(1800	6920)
	(1900	6857)
	(2000	6791)
	(2100	6721)
	(2200	6648)
	(2300	6571)
	(2400	6490)
	(2500	6406)
	(2600	6318)
	(2700	6226)
	(2800	6131)
	(2900	6032)
	(3000	5930)
	(999999	5930)
        );

    }
    thermodynamics
    {
        Cp
        (
	(300	770)
	(1700	770)
	(999999	770)	
        );
        Hf	270000; 		//heat of fusion J/kg
        Sf	0;
    }


    transport
    {
        mu			//dynamic viscosity
        (
            (300	0.00642)
            (1700	0.00642)
            (1800	0.00536)
            (1900	0.00457)
            (2000	0.00395)
            (2100	0.00347)
            (2200	0.00308)
            (2300	0.00276)
            (2400	0.00250)
            (2500	0.00228)
            (2600	0.00210)
            (2700	0.00194)
            (2800	0.00180)
            (2900	0.00169)
            (3000	0.00158)
            (999999	0.00158)
        );



        kappa
        (
	(300	18.0)
	(1700	18.0)
	(1800	18.3)
	(1900	18.6)
	(2000	19.0)
	(2100	19.3)
	(2200	19.6)
	(2300	20.0)
	(2400	20.3)
	(2500	20.6)
	(2600	20.9)
	(2700	21.3)
	(2800	21.6)
	(2900	21.9)
	(3000	22.3)
	(999999	22.3)	
        );
    }
}