system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.000001;

vertices
(
    (0 0 0)
    (1500 0 0)
    (1500 400 0)
    (0 400 0)
    (0 0 300)
    (1500 0 300)
    (1500 400 300)
    (0 400 300)
    (0 0 400)
    (1500 0 400)
    (1500 400 400)
    (0 400 400)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 60 45) simpleGrading (1 ((0.1875 0.0833333333 0.1) (0.625 0.833333333 1) (0.1875 0.0833333333 10)) ((0.3333333 0.111111111 0.1) (0.6666667 0.888888889 1) (0 0 1)))
    hex (4 5 6 7 8 9 10 11) (300 60 10) simpleGrading (1 ((0.1875 0.0833333333 0.1) (0.625 0.833333333 1) (0.1875 0.0833333333 10)) ((0.25 0.5 1) (0.75 0.5 5) (0 0 1)))
);

edges
(
);

boundary
(
    back
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    left
    {
	type wall;
	faces
	(
	    (3 7 6 2)
	);
    }
    gasSides
    {
        type patch;
        faces
        (
            (4 8 11 7)
	    (6 10 9 5)
	    (5 9 8 4)
	    (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
