system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     myIcoReactingMultiphaseInterFoam2306;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime      0.0013;
deltaT          1e-8;
writeControl    adjustableRunTime;
writeInterval   1e-5;
purgeWrite      0;
writeFormat     binary;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxDeltaT       5e-7;
maxCo           2.0;
maxAlphaCo      1.5;
maxAlphaDdt     0.1;
maxDi           5000;
// ************************************************************************* //
