system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-03;

        cAlphas          ((liquid and gas) 1
			  (liquid and solid) 1
			  (solid and gas) 1);

        nAlphaCorr      1;
        nAlphaSubCycles 3;

        // Compressiion factor for species in each alpha phase
        // NOTE: It should be similar to cAlpha
        cYi             1;
    }

    "p_rgh.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-03;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-03;
    }


    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          1e-03;
    }

    "Yi.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          1e-03;
        residualAlpha   1e-06;
    }

    "T.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-03;
    }

    "mDotSmear.*"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-03;
    }

    "Xvapour.gas.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-03;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    25;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p_rgh
        {
                tolerance  1e-06;
                relTol     1e-03;
        }
	T
	{
		tolerance   1e-06;
		relTol		1e-03;
	}
	"U.*"
	{
		tolerance	1e-06;
		relTol		1e-03;
	}
     }
}

relaxationFactors
{
    fields
    {
	".*"	1;
    }
    equations
    {
        ".*"     1;
    }
}


// ************************************************************************* //

